---
type: SelectionChangedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# SelectionChangedEventArgs

`Autodesk.Revit.UI.Events.SelectionChangedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDocument | 2023 | `public Document GetDocument ()` |
| Method | GetReferences | 2023 | `public IList < Reference > GetReferences ()` |
| Method | GetSelectedElements | 2023 | `public ISet < ElementId > GetSelectedElements ()` |